#Область СлужебныйПрограммныйИнтерфейс

#Область Серилизация

Функция ЗаписатьДанныеВJSON(Знач Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
	
	НастройкаСерилизацииJSON = Новый НастройкиСериализацииJSON();
	НастройкаСерилизацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	НастройкаСерилизацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;

	Попытка
		ЗаписатьJSON(ЗаписьJSON, Данные, НастройкаСерилизацииJSON);
		Возврат ЗаписьJSON.Закрыть();
	Исключение
		ЗаписьЖурналаРегистрации("JWT", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции


#КонецОбласти
	

#КонецОбласти
