#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТокен(Запрос) Экспорт

	Попытка
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Исключение
		Возврат HTTPОбщегоНазначения.СформироватьОтвет(, ИнформацияОбОшибке(), 500);
	КонецПопытки;
	
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат HTTPОбщегоНазначения.СформироватьОтвет(, "Пользователь не найден", 400);
	КонецЕсли;
	
	Возврат HTTPОбщегоНазначения.СформироватьОтвет(, "хз", 500);
	
	
КонецФункции


#КонецОбласти
